/* 
  Localizable.strings
  DevToys

  Created by yuki on 2022/02/13.
  
*/

// - General -
"Configuration" = "設定";
"Format" = "フォーマット";
"Pretty" = "美しく";
"Minified" = "小さく";
"Encoded" = "エンコード";
"Decoded" = "デコード";
"File" = "ファイル";
"Text" = "テキスト";
"Copy" = "コピー";
"Paste" = "ペースト";
"Copied!" = "コピーされました";
"Pasted!" = "ペーストされました";
"Open" = "開く";
"Export" = "書き出し";
"Import" = "開く...";
"Input" = "入力";
"Output" = "出力";
"No selection" = "選択なし";
"Drop Files Here" = "ここにファイルをドロップ";
"Untitled Tool" = "無名のツール";
"Uppercase" = "大文字";
"Hyphens" = "ハイフン";
"Type" = "種類";
"Length" = "長さ";
"Convert" = "変換";
"Information" = "情報";
"Charactors" = "文字数";
"Words" = "単語数";
"Lines" = "行数";
"Bytes" = "バイト数";
"Clear" = "クリア";
"Delete" = "削除";
"Open in Finder" = "Finderで開く";
"Quick Look" = "クイックルック";
"Default" = "デフォルト";

// - Category -
"category.home" = "ホーム";
"category.converters" = "変換";
"category.encoders_decoders" = "エンコード / デコード";
"category.formatters" = "フォーマット";
"category.generators" = "生成";
"category.text" = "テキスト";
"category.graphic" = "画像";
"Media" = "メディア";

// - Tool -
"tool.home.title" = "ホーム";
"tool.home.mintitle" = "ホーム";
"tool.home.description" = "全てのツールをここで探せます";

"tool.jsonyaml.title" = "JSONとYamlの変換";
"tool.jsonyaml.mintitle" = "JSON/Yaml";
"tool.jsonyaml.description" = "JSONとYamlを相互に変換します";

"tool.numbase.title" = "基数の変換";
"tool.numbase.mintitle" = "基数の変換";
"tool.numbase.description" = "数値の進法を変換します";
"Format Number" = "数値をフォーマット";
"Decimal" = "10進数";
"Hexdecimal" = "16進数";
"Octal" = "8進数";
"Binary" = "2進数";

"tool.date.title" = "日付の変換";
"tool.date.mintitle" = "日付の変換";
"tool.date.description" = "日付の表現を変換します";
"Now" = "現在";
"Date" = "日付";
"Unix Time" = "Unix時";
"ISO 8601" = "ISO 8601";
"Calender" = "カレンダー";

"tool.html.title" = "HTMLのエンコード・デコード";
"tool.html.mintitle" = "HTML";
"tool.html.description" = "文字をHTMLエスケープ・アンエスケープします";

"tool.url.title" = "URLのエンコード・デコード";
"tool.url.mintitle" = "URL";
"tool.url.description" = "文字をURLパーセントエンコード・逆パーセントエンコードします";

"tool.base64.title" = "Base64エンコード・デコード";
"tool.base64.mintitle" = "Base64";
"tool.base64.description" = "文字・ファイルをBase64にエンコード・デコードします";
"Source Type" = "入力";
"Text Source" = "テキストを入力";
"File Source" = "ファイルを入力";

"tool.jwt.title" = "JWTのデコード";
"tool.jwt.mintitle" = "JWT";
"tool.jwt.description" = "JWTのヘッダ・ペイロードをデコードします";
"JWT Token" = "JWTトークン";
"Header" = "ヘッダ";
"Payload" = "ペイロード";

"tool.jsonformat.title" = "JSONのフォーマット";
"tool.jsonformat.mintitle" = "JSON";
"tool.jsonformat.description" = "JSONデータを美しく表示したり、最小化します";
"Indentation" = "インデント";
"2 Spaces" = "2スペース";
"4 Spaces" = "4スペース";
"1 Tab" = "1タブ";

"tool.xmlformat.title" = "XMLのフォーマット";
"tool.xmlformat.mintitle" = "XML";
"tool.xmlformat.description" = "XMLデータを美しく表示したり、最小化します";
"HTML Document" = "HTMLドキュメント";
"XML Document" = "XMLドキュメント";
"Document Type" = "ドキュメントの種類";
"Auto Fix Document" = "自動修正";
"Pretty Document" = "読みやすい表示";

"tool.hashgen.title" = "Hashを生成";
"tool.hashgen.mintitle" = "Hash";
"tool.hashgen.description" = "テキストのMD5・SHA1・SHA256・SHA512を計算します";

"tool.uuidgen.title" = "UUIDを生成";
"tool.uuidgen.mintitle" = "UUID";
"tool.uuidgen.description" = "UUIDsを生成します";
"Generate UUIDs" = "UUIDを生成";

"tool.ligen.title" = "Lorem Ipsumを生成";
"tool.ligen.mintitle" = "Lorem Ipsum";
"tool.ligen.description" = "Lorem Ipsumの単語・文・段落を生成します";
"Type of generating Lorem Ipsum" = "生成するLorem Ipsumの種類";
"Length of generating Lorem Ipsum" = "生成するLorem Ipsumの長さ";
"Words" = "文字";
"Sentences" = "文章";
"Paragraphs" = "段落";

"tool.checksum.title" = "Checksumを生成";
"tool.checksum.mintitle" = "Checksum";
"tool.checksum.description" = "ファイルのChecksumを生成・検証します";
"Output Comparer" = "出力との比較";
"Hash Algorithm" = "ハッシュのアルゴリズム";
"Select which algorithm you want to use" = "使いたいアルゴリズムを選んでください";

"tool.textinspect.title" = "テキストデータと文字変換";
"tool.textinspect.mintitle" = "データと文字変換";
"tool.textinspect.description" = "テキストのデータの解析・文字変換を行います";

"tool.regex.title" = "正規表現のテスト";
"tool.regex.mintitle" = "正規表現";
"tool.regex.description" = "正規表現をテストします";
"Reguler expression" = "正規表現";

"tool.hyphenremove.title" = "ハイフン削除";
"tool.hyphenremove.mintitle" = "ハイフン削除";
"tool.hyphenremove.description" = "PDFテキストからコピーされたハイフンを削除します";

"tool.imageoptim.title" = "PNG・JPEG最適化";
"tool.imageoptim.mintitle" = "PNG・JPEG最適化";
"tool.imageoptim.description" = "PNG・JPEG形式の画像を最適化してファイルサイズを小さくします";
"Optimize Level" = "最適化レベル";
"Low" = "低レベル";
"Medium" = "中レベル";
"High" = "高レベル";
"Very High (Slow)" = "非常に高レベル (時間がかかります)";

"tool.pdfgen.title" = "画像をPDF化";
"tool.pdfgen.mintitle" = "画像をPDF化";
"tool.pdfgen.description" = "複数枚の画像を1つのPDFファイルにまとめます";
"Images" = "画像";
"Size" = "サイズ";
"Generate PDF" = "PDFを作成";
"Page" = "ページ";

"tool.imageconvert.title" = "画像の変換";
"tool.imageconvert.mintitle" = "画像の変換";
"tool.imageconvert.description" = "画像のフォーマットの変換やリサイズを行います";
"PNG Format" = "PNG形式";
"JPEG Format" = "JPEG形式";
"TIFF Format" = "TIFF形式";
"GIF Format" = "GIF形式";
"Scale to Fill" = "サイズを埋める";
"Scale to Fit" = "サイズ内に収める";
"Image Format" = "フォーマット";
"Resize" = "リサイズ";
"Converted Images" = "変換した画像";
"Scale" = "大きさの変換";
"Size" = "サイズ";
"Override original file" = "元のファイルを上書き";

"QR Code Generator" = "QRコード作成";
"Create a QR code from text" = "テキストからQRコードを作成します";
"Correction Level" = "誤り復元";
"QR Code" = "QRコード";

"Settings" = "設定";
"Setting of application" = "アプリの設定を行います";
"App Theme" = "アプリのテーマ";
"Select which app theme to display" = "表示に用いるテーマの選択";
"Use system setting" = "自動";
"Light mode" = "ライト";
"Dark mode" = "ダーク";

"Color Picker" = "カラーピッカー";
"Picker the color and copy components" = "色を選択してフォーマットした文字列をコピーします";
"HSB Box" = "HSBボックス";
"HSB Circle" = "HSBサークル";
"HSB Circle and Bars" = "HSB バー&サークル";
"Pick Color" = "色を選択";
"Picker Type" = "選択のタイプ";
"Color Hex" = "Hex値";
"Color Copy" = "色をコピー";
"Color Copy Type" = "型";

"Gif Converter" = "Gifへの変換";
"Convert a movie to an animated GIF file" = "動画をアニメーションGifに変換します";
"Width" = "幅";
"The width of the Gif file" = "Gifファイルの横幅 (高さは自動決定されます)";
"FPS" = "FPS";
"FPS of the Gif file to be exported" = "書き出すGifファイルのFPS";
"Remove source file" = "元ファイルを削除";
"Whether to delete the source file after exporting a Gif" = "Gifファイル書き出し後に元ファイルを削除するか";

"Audio Converter" = "音声フォーマット変換";
"Convert audio from one format to another" = "音声ファイルのフォーマット・音質の変更を行います";
"Whether to delete the source file after exporting a Audio" = "ファイル書き出し後に元ファイルを削除するか";
"Starting..." = "初期化中...";
"Complete" = "完了";
"Convert Failed" = "変換失敗";

"Text Diff" = "テキストの比較";
"Compare two Text and display Diff" = "2つのテキストを比べて差分を表示します";
"By Characters" = "文字";
"By Words" = "単語";
"By Lines" = "行";
"Input 1" = "元のテキスト";
"Input 2" = "変更後のテキスト";
"Diff Style" = "差分の取り方";
